# Нижче невеличке тестове завдання на python + pytest. Розв'язок надсилайте у будь-якому зручному Вам вигляді.
#
# Дедлайн: до 14:00 25.07.2024
#
#
# Задача:
#
# Є кінцева точка API http://my-server.com:5002/jetta-receiver
#
# Якщо надіслати на точку POST запит з тілом
# # {
# #   "action": "add",
# #   "car": {
# #     "make": "Volkswagen",
# #     "model": "Jetta"
# #   }
# # }
#
# Тоді у відповідь прийде 200 ОК і поверне json
# # {
# #   "car": {
# #     "make": "Volkswagen",
# #     "model": "Jetta"
# #   },
# #   "result": "added successfully"
# # }
#
# Якщо в тілі запиту буде інші дані, тоді точка поверне 204 No Content.
#
# Якщо надіслати інший метод крім POST, тоді повернеться код 405 Method Not Allowed
#
# Напишіть тест на pytest який перевірятиме
# - успішне додавання авто (200 ОК)
# - валідність доданих даних авто
# - випадок з невалідними даними в тілі запиту (204 No Content)
# - тест з іншим методом крім POST (405)